sbm-webinar.cabinet/src/InformationRegisters/ЛКК_ВыгруженнаяНоменклатура/ЛКК_ВыгруженнаяНоменклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛКК_ВыгруженнаяНоменклатура</name>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

sbm-webinar.cabinet/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="49c4fd20-9868-483b-b488-8c57fd046bdc">
  <name>ЦеныНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="0d19eb74-bf6e-4116-86fe-df31d53de608">
    <name>Цена</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="60782cbe-1ea8-49b3-8d12-06b63e48f302">
    <name>ВидЦен</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="a28e04ee-8fae-48f0-b7c4-e031134c920f">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="4d003232-5e09-4e5c-94f9-008a3b9c38e0">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

sbm-webinar.cabinet/src/InformationRegisters/ЛКК_ВыгруженныеКонтрагенты/ЛКК_ВыгруженныеКонтрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛКК_ВыгруженныеКонтрагенты</name>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

sbm-webinar.cabinet/src/InformationRegisters/ЛКК_ВыгруженныеКонтактныеЛица/ЛКК_ВыгруженныеКонтактныеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛКК_ВыгруженныеКонтактныеЛица</name>
  <dimensions>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

sbm-webinar.cabinet/src/InformationRegisters/ЛКК_ЗагруженныеЗаказы/ЛКК_ЗагруженныеЗаказы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛКК_ЗагруженныеЗаказы</name>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

sbm-webinar.cabinet/src/Enums/ВидыОперацийЗаказПокупателя/ВидыОперацийЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="abca0eb3-f5c5-4fdc-9dfb-2984a5e79fb6">
  <name>ВидыОперацийЗаказПокупателя</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="9a38d142-c39a-4c4a-9d2e-e4b56007d36c">
    <name>ЗаказНаПродажу</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

sbm-webinar.cabinet/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="9133d1ee-54e6-4556-8f42-a94010c0b021">
  <name>ЗаказПокупателя</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="827874fd-5db1-4d45-bdf0-89e668848359">
    <name>КонтактноеЛицоПодписант</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1371d910-ad1b-48fe-ae24-803656eb6c75">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fd1e7d34-4bc2-4c14-b4a7-bdb058ca9024">
    <name>ВидОперации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ba7dcb3b-b8b9-4d44-ab5f-56f7a228f10d">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1864a4fa-3bca-4347-bf6a-82bdf3e87b6f">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b3aa3fca-af25-468f-9d52-5d2789269a08">
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e31f38f0-d57f-4c04-a6ee-5e6e0e60f295">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1ee6def9-9763-4cdc-ac1f-f624375bec09">
    <name>ВалютаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="807428cd-6b50-4247-b2f8-2ccebeff907a">
    <name>Курс</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d67281b6-66b8-4c76-adc4-56ce97287e4b">
    <name>Кратность</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="852f28be-4055-4b73-91c4-758c93071df6">
    <name>ВидЦен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="571d8f35-5093-45ef-ac32-348e93ef2294">
    <name>БанковскийСчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="40b29a9d-d013-4561-9f2c-c88ad5a45fff">
    <name>Касса</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e9e03101-b170-4fdc-a01c-996193bbb1ab">
    <name>ДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="3827a494-db18-4d85-98ff-9376e84082d1">
    <name>Запасы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="28f6394b-43df-422c-bc24-88973f4e6c54">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8a221069-5758-4a3a-bd23-c768badd2b91">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="eab6261f-3bbf-4b7b-a320-ba7c54502cf0">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="bd365b51-d408-43d0-b319-57a41944d0b9">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="55672676-5c6d-41a6-86f0-74444c834892">
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e64cc8ee-4dc5-480c-acb0-145322d9d2ae">
      <name>ЕдиницаИзмерения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

sbm-webinar.cabinet/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="bea7f781-5f18-4219-997c-9a767fb284be">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="27d64301-1b5e-4ac9-82b2-fc31566ecc01">
    <name>ВидСтавкиНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="29ee8eb2-cd83-4cc1-b40d-4e152378ea5c">
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

sbm-webinar.cabinet/src/Catalogs/Организации/Организации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="6a3c1b05-ee48-4aa9-b2c1-4b66e3aeab70">
  <name>Организации</name>
  <objectBelonging>Adopted</objectBelonging>
  <predefined>
    <items>
      <name>ОсновнаяОрганизация</name>
      <description>Наша фирма</description>
    </items>
  </predefined>
  <attributes extendedConfigurationObject="902b41c8-9a79-42c4-b5ee-7d32e7d46ae0">
    <name>БанковскийСчетПоУмолчанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ccfe9a5c-f255-46ce-af0d-e0c873974857">
    <name>КассаПоУмолчанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

sbm-webinar.cabinet/src/CommonModules/ЛКК_ОбменСЛичнымКабинетом/Module.bsl
#Область ПрограммныйИнтерфейс

// Получить заказы на сервере.
// 
// Параметры:
//  ВидЦены - СправочникСсылка.ВидыЦен - Вид цены
Процедура ПолучитьЗаказыНаСервере(ВидЦены) Экспорт
	
	НомерПолученногоСообщения = Константы.ЛКК_НомерПолученногоСообщения.Получить();
	
	ДополнительныйПуть = СтрШаблон("orders?accepted-num=%1", XMLСтрока(НомерПолученногоСообщения));
	
	Ответ = ВыполнитьЗапросGET(ДополнительныйПуть);
	
	Если Ответ.КодСостояния <> 200 Тогда
		ВызватьИсключение СтрШаблон("Ошибка вызова метода, код состояния: %1", Ответ.КодСостояния)
	КонецЕсли;
	
	ДанныеОтвета = ПрочитатьЗначениеJSON(Ответ.ПолучитьТелоКакСтроку());
	
	НачатьТранзакцию();
	
	Попытка
	
		Для Каждого ДанныеЗаказа Из ДанныеОтвета Цикл
			СоздатьЗаказ(ДанныеЗаказа, ВидЦены);
		КонецЦикла;
		
		Константы.ЛКК_НомерПолученногоСообщения.Установить(НомерПолученногоСообщения + 1);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Выгрузить повторно номенклатуру, которая была передана ранее.
Процедура ВыгрузитьПовторноНоменклатуру() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЛКК_ВыгруженнаяНоменклатура.Номенклатура
		|ИЗ
		|	РегистрСведений.ЛКК_ВыгруженнаяНоменклатура КАК ЛКК_ВыгруженнаяНоменклатура";
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	СписокНоменклатуры = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		СписокНоменклатуры.Добавить(Выборка.Номенклатура);
	КонецЦикла;
	
	ОтправитьВыбраннуюНоменклатуру(СписокНоменклатуры);
	
КонецПроцедуры

// Отправить выбранную номенклатуру.
// 
// Параметры:
//  СписокНоменклатуры - Массив из СправочникСсылка.Номенклатура - Список номенклатуры
Процедура ОтправитьВыбраннуюНоменклатуру(СписокНоменклатуры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СправочникНоменклатура.Ссылка КАК Номенклатура,
		|	СправочникНоменклатура.Наименование КАК Наименование,
		|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена
		|ИЗ
		|	Справочник.Номенклатура КАК СправочникНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, Номенклатура В (&СписокНоменклатуры)
		|		И ВидЦен = &ВидЦены
		|		И Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК ЦеныНоменклатурыСрезПоследних
		|		ПО СправочникНоменклатура.Ссылка = ЦеныНоменклатурыСрезПоследних.Номенклатура
		|ГДЕ
		|	СправочникНоменклатура.Ссылка В (&СписокНоменклатуры)";
		
	Запрос.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
	Запрос.УстановитьПараметр("ВидЦены", Константы.ЛКК_ВидЦены.Получить());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДанныеЗапроса = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		ДанныеНоменклатуры = Новый Структура;
		ДанныеНоменклатуры.Вставить("Идентификатор", Строка(Выборка.Номенклатура.УникальныйИдентификатор()));
		ДанныеНоменклатуры.Вставить("Наименование", Выборка.Наименование);
		ДанныеНоменклатуры.Вставить("Цена", Выборка.Цена);
		
		ДанныеЗапроса.Добавить(ДанныеНоменклатуры);
		
	КонецЦикла;
	
	ДополнительныйПуть = "goods";
	
	ТелоЗапроса = ЗаписатьЗначениеJSON(ДанныеЗапроса);	
		
	Ответ = ВыполнитьЗапросPOST(ДополнительныйПуть, ТелоЗапроса);
	
	Если Ответ.КодСостояния <> 200 Тогда
		ВызватьИсключение СтрШаблон("Ошибка вызова метода, код состояния: %1", Ответ.КодСостояния)
	КонецЕсли;
	
	Для Каждого Номенклатура Из СписокНоменклатуры Цикл
		Запись = РегистрыСведений.ЛКК_ВыгруженнаяНоменклатура.СоздатьМенеджерЗаписи();
		Запись.Номенклатура = Номенклатура;
		Запись.Записать();
	КонецЦикла;
	
КонецПроцедуры

// Добавить контрагента в личный кабинет.
// 
// Параметры:
//  Контрагент - СправочникСсылка.Контрагенты - Контрагент
Процедура ДобавитьКонтрагентаВЛичныйКабинет(Контрагент) Экспорт
	
	ДополнительныйПуть = "organizations";
	
	Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "Наименование");
	
	ДанныеЗапроса = Новый Структура;
	ДанныеЗапроса.Вставить("Идентификатор", Строка(Контрагент.УникальныйИдентификатор()));
	ДанныеЗапроса.Вставить("Наименование", Наименование);
	
	ТелоЗапроса = ЗаписатьЗначениеJSON(ДанныеЗапроса);	
		
	Ответ = ВыполнитьЗапросPOST(ДополнительныйПуть, ТелоЗапроса);
	
	Если Ответ.КодСостояния <> 200 Тогда
		ВызватьИсключение СтрШаблон("Ошибка вызова метода, код состояния: %1", Ответ.КодСостояния)
	КонецЕсли;
	
	Запись = РегистрыСведений.ЛКК_ВыгруженныеКонтрагенты.СоздатьМенеджерЗаписи();
	Запись.Контрагент = Контрагент;
	Запись.Записать();
	
КонецПроцедуры

// Добавить представителя в личный кабинет.
// 
// Параметры:
//  Контрагент - СправочникСсылка.Контрагенты - Контрагент
//  НастройкиСоздания - Структура - Настройки создания:
//  	* КонтактноеЛицо - СправочникСсылка.КонтактныеЛица
//  	* Пароль - Строка
//
Процедура ДобавитьПредставителяВЛичныйКабинет(Контрагент, НастройкиСоздания) Экспорт
	
	ДополнительныйПуть = "persons";
	
	КонтактноеЛицо = НастройкиСоздания.КонтактноеЛицо;
	Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КонтактноеЛицо, "Наименование");
	
	КонтактнаяИнформация = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(КонтактноеЛицо,,, Ложь);
	
	АдресЭлектроннойПочты = "";
	Телефон = "";
	
	Для Каждого Строка Из КонтактнаяИнформация Цикл
		Если Строка.Вид = Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица Тогда
			АдресЭлектроннойПочты = Строка.Представление;
		ИначеЕсли Строка.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица Тогда
			Телефон = Строка.Представление;
		КонецЕсли;		
	КонецЦикла;
	
	Отказ = Ложь;
	
	Если Не ЗначениеЗаполнено(АдресЭлектроннойПочты) Тогда
		ОбщегоНазначения.СообщитьПользователю("У представителя должен быть заполнен адрес электронной почты",,,, Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Телефон) Тогда
		ОбщегоНазначения.СообщитьПользователю("У представителя должен быть заполнен телефон",,,, Отказ);
	КонецЕсли;
	
	Телефон = "+" + СтрЗаменитьПоРегулярномуВыражению(Телефон, "[^0-9]", "");
	
	Если СтрДлина(Телефон) <> 12 Тогда
		ОбщегоНазначения.СообщитьПользователю("Некорректный номер телефона у выбранного представителя",,,, Отказ);
	КонецЕсли;		
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Запись = РегистрыСведений.ЛКК_ВыгруженныеКонтактныеЛица.СоздатьМенеджерЗаписи();
	Запись.КонтактноеЛицо = КонтактноеЛицо;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеЗапроса = Новый Структура;
	ДанныеЗапроса.Вставить("Идентификатор", Строка(КонтактноеЛицо.УникальныйИдентификатор()));
	ДанныеЗапроса.Вставить("Наименование", Наименование);
	ДанныеЗапроса.Вставить("Организация", Строка(Контрагент.УникальныйИдентификатор()));
	ДанныеЗапроса.Вставить("Телефон", Телефон);
	ДанныеЗапроса.Вставить("АдресЭлектроннойПочты", АдресЭлектроннойПочты);
	ДанныеЗапроса.Вставить("Пароль", НастройкиСоздания.Пароль);	
	
	ТелоЗапроса = ЗаписатьЗначениеJSON(ДанныеЗапроса);	
		
	Ответ = ВыполнитьЗапросPOST(ДополнительныйПуть, ТелоЗапроса);
	
	Если Ответ.КодСостояния <> 200 Тогда
		ВызватьИсключение СтрШаблон("Ошибка вызова метода, код состояния: %1", Ответ.КодСостояния)
	КонецЕсли;
	
	Запись = РегистрыСведений.ЛКК_ВыгруженныеКонтактныеЛица.СоздатьМенеджерЗаписи();
	Запись.КонтактноеЛицо = КонтактноеЛицо;
	Запись.Записать();
	
КонецПроцедуры

// Проверить подключение.
// 
// Возвращаемое значение:
//  Строка - Результат проверки подключения
Функция ПроверитьПодключение() Экспорт
	
	ДополнительныйПуть = "ping";
	
	Ответ = ВыполнитьЗапросGET(ДополнительныйПуть, Ложь);
	
	Если Ответ.КодСостояния = 200 Тогда
		Возврат "Соединение проверено успешно";
	Иначе
		Возврат СтрШаблон("Ошибка проверки соединения, код состояния: %1", Ответ.КодСостояния);
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СоздатьЗаказ(ДанныеЗаказа, ВидЦены)
	
	ДокументСсылка = Документы.ЗаказПокупателя.ПолучитьСсылку(
		Новый УникальныйИдентификатор(ДанныеЗаказа.Идентификатор));
	
	// Для упрощения повторно документы не загружаем
	Если ОбщегоНазначения.СсылкаСуществует(ДокументСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	// Общий алгоритм приведен для примера, для промышленной эксплуатации требуется доработка	
	ДокументОбъект = Документы.ЗаказПокупателя.СоздатьДокумент();
	ДокументОбъект.УстановитьСсылкуНового(ДокументСсылка);
	
	ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаПродажу;
	ДокументОбъект.Организация = Справочники.Организации.ОсновнаяОрганизация;
	
	Контрагент = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеЗаказа.Организация));	
	Договор = Справочники.ДоговорыКонтрагентов.ДоговорПоУмолчанию(Контрагент);
	
	ДокументОбъект.Контрагент = Контрагент;
	ДокументОбъект.Договор = Договор;
	ДокументОбъект.КонтактноеЛицоПодписант = 
		Справочники.КонтактныеЛица.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеЗаказа.Представитель));
	
	ДокументОбъект.НалогообложениеНДС = НалогиУНФ.НалогообложениеНДС(ДокументОбъект.Организация, , ДокументОбъект.Дата);
	
	ДокументОбъект.Комментарий = ДанныеЗаказа.Комментарий;
	
	ДокументОбъект.Дата = ТекущаяДатаСеанса();
	ДокументОбъект.Заполнить(Неопределено);
	
	ДокументОбъект.ВалютаДокумента = Константы.ВалютаУчета.Получить();
	
	Отбор = Новый Структура("Валюта", ДокументОбъект.ВалютаДокумента);
	СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ТекущаяДатаСеанса(), Отбор);
	
	ДокументОбъект.Курс = СтруктураПоВалюте.Курс;
	ДокументОбъект.Кратность = СтруктураПоВалюте.Кратность;
	
	ДокументОбъект.ВидЦен = ВидЦены;
	Если ЗначениеЗаполнено(ДокументОбъект.Организация) Тогда
		ДокументОбъект.БанковскийСчет = ДокументОбъект.Организация.БанковскийСчетПоУмолчанию;
		ДокументОбъект.Касса = ДокументОбъект.Организация.КассаПоУмолчанию;
	КонецЕсли;
	
	ДокументОбъект.ДатаОтгрузки = ТекущаяДатаСеанса() + 86400 * 10; 
	
	Для Каждого ОписаниеСтроки Из ДанныеЗаказа.СписокНоменклатуры Цикл
		Номенклатура = 
			Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(ОписаниеСтроки.Номенклатура));
		НоваяСтрока = ДокументОбъект.Запасы.Добавить();
		НоваяСтрока.Номенклатура = Номенклатура;
		НоваяСтрока.Количество = ОписаниеСтроки.Количество;
		НоваяСтрока.Цена = ОписаниеСтроки.Цена;
		НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.СтавкаНДС(Номенклатура.ВидСтавкиНДС);
		НоваяСтрока.ЕдиницаИзмерения = Номенклатура.ЕдиницаИзмерения;
		ПересчитатьСтрокуТабличнойЧасти(НоваяСтрока, ДокументОбъект);
	КонецЦикла;
	
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	Запись = РегистрыСведений.ЛКК_ЗагруженныеЗаказы.СоздатьМенеджерЗаписи();
	Запись.Заказ = ДокументОбъект.Ссылка;
	Запись.Записать();	
	
КонецПроцедуры

Процедура ПересчитатьСтрокуТабличнойЧасти(СтрокаТабличнойЧасти, Документ)
	
	Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.Цена)
		И ЗначениеЗаполнено(Документ.ВидЦен) Тогда
		
		СтруктураДанные = Новый Структура;
		
		СтруктураДанные.Вставить("ДатаОбработки", Документ.Дата);
		СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
		СтруктураДанные.Вставить("Характеристика", Неопределено);
		СтруктураДанные.Вставить("ВалютаДокумента", Документ.ВалютаДокумента);
		СтруктураДанные.Вставить("СуммаВключаетНДС", Документ.СуммаВключаетНДС);
		СтруктураДанные.Вставить("СтавкаНДС", СтрокаТабличнойЧасти.СтавкаНДС);
		СтруктураДанные.Вставить("ВидЦен", Документ.ВидЦен);
		СтруктураДанные.Вставить("Коэффициент", 1);
		СтруктураДанные.Вставить("ВидСкидкиНаценки", Документ.ВидСкидкиНаценки);

		ЦенообразованиеКлиентСервер.ДополнитьСтруктуруДанныхНоменклатурыПолямиЦенообразования(Документ, СтрокаТабличнойЧасти, СтруктураДанные);

		СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Кратность * СтрокаТабличнойЧасти.Цена;
		
	КонецЕсли;
	
	СуммаБезСкидки = СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество;
	СуммаСкидки = СуммаБезСкидки - СтрокаТабличнойЧасти.Сумма;
	
	Если СуммаСкидки <> 0 Тогда
		СтрокаТабличнойЧасти.ПроцентСкидкиНаценки = 100 * СуммаСкидки / СуммаБезСкидки;
	КонецЕсли;
	
	РассчитатьСуммуНДСЗаказа(СтрокаТабличнойЧасти, Документ);
	
КонецПроцедуры

Процедура РассчитатьСуммуНДСЗаказа(СтрокаТабличнойЧасти, Документ)
	
	Если Документ.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
		
		СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);
		
		СтрокаТабличнойЧасти.СуммаНДС = ?(Документ.СуммаВключаетНДС,
		СтрокаТабличнойЧасти.Сумма - (СтрокаТабличнойЧасти.Сумма) / ((СтавкаНДС + 100) / 100),
		СтрокаТабличнойЧасти.Сумма * СтавкаНДС / 100);
	Иначе
		СтрокаТабличнойЧасти.СуммаНДС = 0;
	КонецЕсли;
	
	СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(Документ.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
	
КонецПроцедуры

Функция НастройкиПодключения()
	
	Адрес = Константы.ЛКК_АдресЛичногоКабинета.Получить();
	
	Результат = НовыеНастройкиПодключения();
	
	Если СтрНачинаетсяС(Адрес, "https") Тогда
		Результат.ЗащищенноеСоединение = ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение()
	КонецЕсли;
	
	АдресБезПротокола = Сред(Адрес, СтрНайти(Адрес, "://") + 3);
	
	Результат.АдресСервера = Лев(АдресБезПротокола, СтрНайти(АдресБезПротокола, "/") - 1);
	Результат.ПутьНаСервере = Сред(АдресБезПротокола, СтрНайти(АдресБезПротокола, "/"));
	
	Возврат Результат;	
	
КонецФункции

// Новые настройки подключения.
// 
// Возвращаемое значение:
//  Структура - Новые настройки подключения:
// * АдресСервера - Строка
// * ПутьНаСервере - Строка
// * ЗащищенноеСоединение - Неопределено
// 
Функция НовыеНастройкиПодключения()
	
	Результат = Новый Структура;
	Результат.Вставить("АдресСервера", "");
	Результат.Вставить("ПутьНаСервере", "");
	Результат.Вставить("ЗащищенноеСоединение", Неопределено);
	
	Возврат Результат	
	
КонецФункции

// Новое соединение.
// 
// Параметры:
//  НастройкиПодключения - см. НовыеНастройкиПодключения
//  Логин - Строка
//  Пароль - Строка
// 
// Возвращаемое значение:
//  HTTPСоединение - Новое соединение с указанными настройками
Функция НовоеСоединение(НастройкиПодключения, Логин = "", Пароль = "")
	
	Возврат Новый HTTPСоединение(
		НастройкиПодключения.АдресСервера,,
		Логин, 
		Пароль,, 
		5, 
		НастройкиПодключения.ЗащищенноеСоединение);
	
КонецФункции

// Выполнить запрос GET.
// 
// Параметры:
//  Соединение - HTTPСоединение - Соединение
//  НастройкиПодключения - см. НовыеНастройкиПодключения
//  ДополнительныйПуть - Строка
//  ТребуетсяАутентификация - Булево - Требуется аутентификация
// 
// Возвращаемое значение:
//  HTTPОтвет - Ответ сервера
Функция ВыполнитьЗапросGET(ДополнительныйПуть, ТребуетсяАутентификация = Истина)
	
	НастройкиПодключения = НастройкиПодключения();	
	Соединение = НовоеСоединение(НастройкиПодключения);
	
	ШаблонАдреса = "%1/api/sbm/%2";
	Адрес = СтрШаблон(ШаблонАдреса, НастройкиПодключения.ПутьНаСервере, ДополнительныйПуть);
	
	Заголовки = Новый Соответствие;
	
	Запрос = Новый HTTPЗапрос(Адрес, Заголовки);
	
	Возврат Соединение.Получить(Запрос);
	
КонецФункции

// Выполнить запрос POST.
// 
// Параметры:
//  Соединение - HTTPСоединение - Соединение
//  НастройкиПодключения - см. НовыеНастройкиПодключения
//  ДополнительныйПуть - Строка
//  Тело - Строка
// 
// Возвращаемое значение:
//  HTTPОтвет - Ответ сервера
Функция ВыполнитьЗапросPOST(ДополнительныйПуть, Тело)
	
	НастройкиПодключения = НастройкиПодключения();	
	Соединение = НовоеСоединение(НастройкиПодключения);
	
	ШаблонАдреса = "%1/api/sbm/%2";
	Адрес = СтрШаблон(ШаблонАдреса, НастройкиПодключения.ПутьНаСервере, ДополнительныйПуть);
	
	Токен = Токен(НастройкиПодключения);
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Authorization", СтрШаблон("Bearer %1", Токен));
	
	Запрос = Новый HTTPЗапрос(Адрес, Заголовки);
	Запрос.УстановитьТелоИзСтроки(Тело);
	
	Возврат Соединение.ВызватьHTTPМетод("POST", Запрос);
	
КонецФункции

Функция Токен(НастройкиПодключения)
	
	ШаблонАдреса = "%1/sys/token";
	Адрес = СтрШаблон(ШаблонАдреса, НастройкиПодключения.ПутьНаСервере);
	
	Логин = Константы.ЛКК_ИдентификаторСлужебногоПользователя.Получить();
	Пароль = Константы.ЛКК_СекретСлужебногоПользователя.Получить();
	
	Соединение = НовоеСоединение(НастройкиПодключения, Логин, Пароль);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
	
	ТелоЗапроса = "grant_type=CLIENT_CREDENTIALS";
	
	Запрос = Новый HTTPЗапрос(Адрес, Заголовки);
	Запрос.УстановитьТелоИзСтроки(ТелоЗапроса);
	
	Ответ = Соединение.ВызватьHTTPМетод("POST", Запрос);
	
	Если Ответ.КодСостояния <> 200 Тогда
		ВызватьИсключение СтрШаблон("Ошибка получения токена, код состояния: %1", Ответ.КодСостояния)
	КонецЕсли;
			
	ДанныеОтвета = ПрочитатьЗначениеJSON(Ответ.ПолучитьТелоКакСтроку());
	
	Возврат ДанныеОтвета.id_token;
	
КонецФункции

#КонецОбласти
